Revit 2024 API
MEPSection.Flow Property
 The flow of the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double Flow { get; }
Visual Basic
Public ReadOnly Property Flow As Double
	Get
Visual C++
public:
property double Flow {
	double get ();
}
Remarks
 In one section, all section members have same flow. Default unit is Cubic feet per second. For Duct, unit type is UT_HVAC_Airflow. For Pipe, unit type is UT_Piping_Flow
See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace